// 2023년 6월 23일 금요일 과제풀이
// 김유준

// 과제 내용
// 2인용 빙고
// → 2023년 6월 22일 목요일 1인용 빙고(5x5)를 기본으로 해서...
// 1. 플레이어 한명을 더 표시해주세요.(사람이어도 되고, 컴퓨터여도 됩니다)
// 2. 한 화면에 두 플레이의 빙고판을 모두 표시해주세요
// 3. 가능하면 두 플레이어의 빙고 판이 다르게 해주세요
// 4. 한 명이 자기 빙고 판의 한 칸을 지우면, 다른 사람 판에서도 같은 "숫자"가 지워지게 해주세요
// 5. 사람이면 번갈아서 입력을 할 수 있도록, 컴퓨터가 다른 쪽이면 사람 입력 후에 컴퓨터도 자기 칸을 하나 지우도록
// 6. 먼저 빙고 5줄을 채우는 쪽이 이깁니다
//(옵션) 애초에 입력을 할 때, 빙고 판 위치 말고 숫자로 입력해서 지우는 것도 좋습니다
//(옵션) 컴퓨터가 최대한 자기가 이기는 쪽으로 칸을 선택하도록 해볼 수 있겠습니다

#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}